---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DividedSurfaceFailures.DividedSurfaceCurveLoopChainIntersectedByExtensions
source: html/c3fac636-f26e-2ce3-c21c-b2bf667020ac.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DividedSurfaceFailures.DividedSurfaceCurveLoopChainIntersectedByExtensions Property

Curve elements forming a chain which is intersected by extensions of the chain ends cannot be used as splitters and are ignored.

## Syntax (C#)
```csharp
public static FailureDefinitionId DividedSurfaceCurveLoopChainIntersectedByExtensions { get; }
```